{
  "backend/main.mo": "Minimal Motoko canister with an empty actor.",
  "feature_evidence.json": "JSON report mapping Valentine-themed features to source files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries describing the purpose of various frontend Valentine experience files.",
  "frontend/index.css": "Tailwind base setup with extensive CSS variables for color themes, dark mode, and core styling tokens.",
  "frontend/index.html": "Base HTML document loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main app component switching between landing and final pages, handling YES celebration flow and background UI layers.",
  "frontend/src/components/AnimatedPromptText.tsx": "Typing-effect or fade-in animated text component for headline prompts.",
  "frontend/src/components/BackgroundMusicControl.tsx": "Floating button managing play/pause of looping romantic background audio.",
  "frontend/src/components/CelebrationBurst.tsx": "Generates heart-burst and falling confetti animations for the YES celebration.",
  "frontend/src/components/FinalPageGate.tsx": "Wrapper that restricts access to final page unless session state grants permission.",
  "frontend/src/components/NoMessagePopup.tsx": "Animated popup showing cute rejection messages that auto-dismiss after a delay.",
  "frontend/src/components/ValentineBackground.tsx": "Dynamic floating hearts and sparkles background with randomized positions and animations.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing authenticated or anonymous backend actors via Internet Identity and react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading, login, and clearing identity state.",
  "frontend/src/hooks/useNoButtonEvasion.ts": "Implements playful NO-button evasion by randomly shifting and scaling the button and tracking dodge count.",
  "frontend/src/hooks/useQueries.ts": "Stub hook returning no backend queries for the frontend‑only experience.",
  "frontend/src/hooks/useValentineSessionGate.ts": "Manages session-based access control by storing and checking whether the user has granted Valentine access.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive Valentine-themed color variables and animations for the site.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with query and Internet Identity providers, and loads global styles.",
  "frontend/src/pages/FinalPage.tsx": "Renders the final Valentine page with animated text, a couple illustration, and a celebratory message.",
  "frontend/src/pages/LandingPage.tsx": "Displays the main prompt with YES/NO buttons, NO-button evasion, cycling messages, and optional celebration effects.",
  "frontend/tailwind.config.js": "Configures Tailwind with Valentine color tokens, custom animations, typography, and container settings.",
  "project_state.json": "Project metadata describing the Valentine experience, features, requirements, and current architectural notes."
}